; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	spectrograph0 - mode
	infrared3 - mode
	thermograph2 - mode
	spectrograph1 - mode
	GroundStation1 - direction
	Star2 - direction
	Star5 - direction
	Star0 - direction
	GroundStation4 - direction
	Star3 - direction
	Planet6 - direction
	Planet7 - direction
	Planet8 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Planet11 - direction
	Phenomenon12 - direction
	Planet13 - direction
	Star14 - direction
	Star15 - direction
)
(:init
	(supports instrument0 infrared3)
	(supports instrument0 spectrograph1)
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 Star3)
	(supports instrument1 thermograph2)
	(supports instrument1 spectrograph1)
	(supports instrument1 infrared3)
	(calibration_target instrument1 Star0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star5)
	(supports instrument2 thermograph2)
	(calibration_target instrument2 GroundStation4)
	(supports instrument3 spectrograph1)
	(supports instrument3 infrared3)
	(supports instrument3 spectrograph0)
	(calibration_target instrument3 Star3)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet8)
)
(:goal (and
	(pointing satellite1 Planet11)
	(have_image Planet6 infrared3)
	(have_image Planet7 spectrograph0)
	(have_image Planet8 spectrograph1)
	(have_image Planet9 spectrograph1)
	(have_image Phenomenon10 spectrograph1)
	(have_image Planet11 spectrograph0)
	(have_image Phenomenon12 thermograph2)
	(have_image Planet13 spectrograph1)
	(have_image Star14 spectrograph0)
	(have_image Star15 spectrograph1)
))

)

; plan
1. (turn_to satellite1 star3 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 star3)
   goals met: 0 of 11
2. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 11
3. (calibrate satellite1 instrument3 star3)
   added: (calibrated instrument3)
   goals met: 0 of 11
4. (turn_to satellite1 planet6 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 planet6)
   goals met: 0 of 11
5. (take_image satellite1 planet6 instrument3 infrared3)
   added: (have_image planet6 infrared3)
   goals met: 1 of 11
6. (turn_to satellite1 planet13 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 planet13)
   goals met: 1 of 11
7. (take_image satellite1 planet13 instrument3 spectrograph1)
   added: (have_image planet13 spectrograph1)
   goals met: 2 of 11
8. (turn_to satellite1 phenomenon10 planet13)
   deleted: (pointing satellite1 planet13)
   added: (pointing satellite1 phenomenon10)
   goals met: 2 of 11
9. (turn_to satellite0 star0 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 star0)
   goals met: 2 of 11
10. (take_image satellite1 phenomenon10 instrument3 spectrograph1)
   added: (have_image phenomenon10 spectrograph1)
   goals met: 3 of 11
11. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 3 of 11
12. (calibrate satellite0 instrument1 star0)
   added: (calibrated instrument1)
   goals met: 3 of 11
13. (turn_to satellite0 phenomenon12 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 phenomenon12)
   goals met: 3 of 11
14. (take_image satellite0 phenomenon12 instrument1 thermograph2)
   added: (have_image phenomenon12 thermograph2)
   goals met: 4 of 11
15. (turn_to satellite0 planet8 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 planet8)
   goals met: 4 of 11
16. (take_image satellite0 planet8 instrument1 spectrograph1)
   added: (have_image planet8 spectrograph1)
   goals met: 5 of 11
17. (turn_to satellite0 planet9 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 planet9)
   goals met: 5 of 11
18. (take_image satellite0 planet9 instrument1 spectrograph1)
   added: (have_image planet9 spectrograph1)
   goals met: 6 of 11
19. (turn_to satellite0 star15 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star15)
   goals met: 6 of 11
20. (take_image satellite0 star15 instrument1 spectrograph1)
   added: (have_image star15 spectrograph1)
   goals met: 7 of 11
21. (turn_to satellite1 planet7 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 planet7)
   goals met: 7 of 11
22. (take_image satellite1 planet7 instrument3 spectrograph0)
   added: (have_image planet7 spectrograph0)
   goals met: 8 of 11
23. (turn_to satellite1 star14 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 star14)
   goals met: 8 of 11
24. (take_image satellite1 star14 instrument3 spectrograph0)
   added: (have_image star14 spectrograph0)
   goals met: 9 of 11
25. (turn_to satellite1 planet11 star14)
   deleted: (pointing satellite1 star14)
   added: (pointing satellite1 planet11)
   goals met: 10 of 11
26. (take_image satellite1 planet11 instrument3 spectrograph0)
   added: (have_image planet11 spectrograph0)
   goals met: 11 of 11
